#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include  <conio.h>
#include <time.h>

int main( )
{
    int s, t,round = 1, res = 0;
    int pt1 = 0,pt2 = 0;
    int i;
    int j = 0, k = 1;
    int a[300] = {1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,1,2,};

    printf("*******************************************************\n");
    printf("********************欢迎进入30游戏！*******************\n按任意键阅读游戏规则并开始游戏！");
    getch();
    system("cls");                  //清屏

    printf("*******************************************************\n");
    printf("游戏规则：\n1.随机生成1或2，1表示玩家1先出手，2表示玩家2先出手。\n");
    printf("2.从0开始计数，玩家交替操作，每次只可+1或+2。\n");
    printf("3.先达到30的玩家获得一盘比赛的胜利，并记10分。\n");
    printf("4.谁先达到50分将获得最终胜利。\n");
    printf("                     按任意键以开始游戏！\n");
    printf("*******************************************************\n");
    getch();
    system("cls");



    for(i=0;i<=round;i++)
    {
        printf("******************************第%d局*************************\n",round);
        printf("得分情况：\n玩家1：%d\t玩家2：%d\n",pt1,pt2);
        t = rand()%2+1;
        printf("玩家%d先手 \n",t);
        printf("游戏开始\n***0***\n");
        while(res <= 29)
    {
        if(t == 1)
      {
          printf("当前轮到%d号玩家出手！\n",a[j ++]);




        scanf("%d",&s);
        if (s == 1)
        {
            res = res + 1;
            printf("***%d***\n",res);

        }
        if (s == 2)
        {
            res = res + 2;
            printf("***%d***\n",res);
        }
        if (s<1 || s > 2)
        {
            printf("***非法的输入格式！***\n");
        }
      }
      if(t == 2)
      {
        printf("当前轮到%d号玩家出手！\n",a[k ++]);
        scanf("%d",&s);
        if (s == 1)
        {
            res = res + 1;
            printf("***%d***\n",res);

        }
        if (s == 2)
        {
            res = res + 2;
            printf("***%d***\n",res);
        }
        if (s<1 || s > 2)
        {
            printf("***非法的输入格式！***\n");
        }
      }


    }
    if (a[k] == 2)
       {
            printf("玩家1胜！+10分！\n");
            pt1 = pt1 + 10;
             getch();
            system("cls");
       }
    else if (res == 31)
        {
            printf("平局！\n");
             getch();
            system("cls");
        }
    else
        {
            printf("玩家2胜！+10分！\n");
            pt2 = pt2 + 10;
            getch();
            system("cls");
        }
    res = 0;
    round ++;
     if ((pt1 == 50) || (pt2 == 50))
    {
        round = 0;
        printf("游戏结束！\n");
        printf("得分情况：\n玩家1：%d\t玩家2：%d\n",pt1,pt2);
    }
    }

}
